coord1 = input('Введите координаты первой клетки: ')
coord2 = input('Введите координаты второй клетки: ')

if (((ord(coord1[0]) + int(coord1[1])) % 2 == 0 and (ord(coord2[0]) + int(coord2[1])) % 2 == 0) 
    or ((ord(coord1[0]) + int(coord1[1])) % 2 == 1 and (ord(coord2[0]) + int(coord2[1])) % 2 == 1)):
    print ('да')
else: 
    print ('нет')

# Введите координаты первой клетки: a1
# Введите координаты второй клетки: b2
# да

# Введите координаты первой клетки: f5
# Введите координаты второй клетки: a5
# нет